#请查询2022年9月2日这天下订单的用户的访问次数？
#首先在order_tb表中检索到2022年9月2日下单的用户
#在visit_tb表中满足上一条要求的记录，同时也要检索到2022年9月2日访问的用户
#最后按照user_id聚合求COUNT



SELECT  user_id,
        COUNT(*) AS visit_nums
FROM visit_tb
WHERE user_id IN(SELECT user_id FROM order_tb WHERE DATEDIFF(DATE(order_time),'2022-09-02')=0) 
    AND DATEDIFF(DATE(visit_time),'2022-09-02')=0
GROUP BY user_id
ORDER BY visit_nums DESC;

/*
描述
现有某个商城部分订单数据，用户访问数据，如下所示：
订单信息表：order_tb（订单id-order_id,用户id-user_id,订单金额-order_price,订单创建时间-order_time）
order_id	user_id	order_price	order_time
101	11	380	2022-09-01 09:00:00
102	12	200	2022-09-01 10:00:00
103	13	260	2022-09-01 12:00:00
104	11	100	2022-09-02 11:00:00
105	12	150	2022-09-02 12:00:00
106	12	1200	2022-09-02 13:00:00
107	11	60	2022-09-03 09:00:00
108	13	380	2022-09-03 09:30:00
访问信息表：visit_tb（访问信息id-info_id,用户id-user_id,访问时间-visit_time,离开时间-leave_time）
info_id	user_id	visit_time	leave_time
911	10	2022-09-01 08:00:00	2022-09-01 09:02:00
912	11	2022-09-01 08:30:00	2022-09-01 09:10:00
913	12	2022-09-01 09:50:00	2022-09-01 10:12:00
914	13	2022-09-01 11:40:00	2022-09-01 12:22:00
921	11	2022-09-02 10:30:00	2022-09-02 11:05:00
922	11	2022-09-02 12:00:00	2022-09-02 12:02:00
923	12	2022-09-02 11:40:00	2022-09-02 13:15:00
924	13	2022-09-02 09:00:00	2022-09-02 09:02:00
925	14	2022-09-02 10:00:00	2022-09-02 10:40:00
931	10	2022-09-03 09:00:00	2022-09-03 09:22:00
932	11	2022-09-03 08:30:00	2022-09-03 09:10:00
933	13	2022-09-03 09:00:00	2022-09-03 09:32:00

请查询2022年9月2日这天下订单的用户的访问次数？
要求输出：user_id,访问次数
注：访问次数定义为用户在该日"访问-离开"则记录1次，输出结果按照访问次数降序排序
示例数据结果如下：
user_id	visit_nums
11	2
12	1
结果解释：
2022年9月2日这天user_id为11、12的用户下了订单，
其中11用户分别在10:30-11:05及12:00-12:02访问，故访问次数为2次，
12用户在11:40-13:15访问，故访问次数为1次。
*/
