#根据用户访问数据统计出每日不同会员等级访问人次及访问人数
#访问人次，对表visit_tb按照user_id进行聚合，输出单用户访问的次数，成为表CET1
#将表CET1左连接uservip_tb表，按照不同的会员号聚合，COUNT求出访问人数，SUM加单用户的访问次数得到访问人次
#按照访问人次降序排序

WITH CET1 AS(
    SELECT  user_id,
            COUNT(*) AS total_num
    FROM visit_tb
    GROUP BY user_id
)

SELECT  u.vip,
        SUM(total_num) AS visit_nums,
        COUNT(*) AS visit_users
FROM  CET1 AS c
LEFT JOIN uservip_tb AS u  USING(user_id)
GROUP BY u.vip
ORDER BY visit_nums DESC,visit_users DESC;

/*
描述
现有某商家用户访问数据及用户会员等级数据，如下所示：
用户访问信息表：visit_tb（访问信息id-info_id，用户id-user_id，访问时间-visit_time，离开时间-leave_time）
info_id	user_id	visit_time	leave_time
911	10	2022-09-01 08:00:00	2022-09-01 09:02:00
912	11	2022-09-01 08:30:00	2022-09-01 09:10:00
913	12	2022-09-01 09:50:00	2022-09-01 10:12:00
914	13	2022-09-01 11:40:00	2022-09-01 12:22:00
921	11	2022-09-02 10:30:00	2022-09-02 11:05:00
922	11	2022-09-02 12:00:00	2022-09-02 12:02:00
923	12	2022-09-02 11:40:00	2022-09-02 13:15:00
924	13	2022-09-02 09:00:00	2022-09-02 09:02:00
925	14	2022-09-02 10:00:00	2022-09-02 10:40:00
931	10	2022-09-03 09:00:00	2022-09-03 09:22:00
932	11	2022-09-03 08:30:00	2022-09-03 09:10:00
933	13	2022-09-03 09:00:00	2022-09-03 09:32:00
会员等级信息表：uservip_tb（用户id-user_id，会员等级-vip，积分-point）
user_id	vip	point
10	银卡会员	530
11	银卡会员	1555
12	钻石会员	12000
13	金卡会员	6115
14	普通会员	230
15	银卡会员	810
16	普通会员	330
根据用户访问数据统计出每日不同会员等级访问人次及访问人数。
要求输出：会员等级、访问人次、访问人数
注：按照访问人次降序排序
示例数据结果如下：
vip	visit_nums	visit_users
银卡会员	6	2
金卡会员	3	1
钻石会员	2	1
普通会员	1	1
结果解释：
钻石会员有user_id为12的用户，该用户分别在9月1日、9月2日访问，故访问人次为2、访问人数为1；
其他结果同理。
*/
